{
    "affirmations": [
        "We used to accept used to have moments between things where nothing happened. We could be alone with our thoughts. Now we have screens. Just be present, it might help.",
        "Every day is an opportunity to reinvent yourself. Embrace it and grow.",
        "Yesterday is history, tomorrow is a mystery, but today is a gift. That's why it's called the present.",
        "You are not your thoughts. You are the awareness behind them. Observe them without judgment.",
        "This fleeting moment is where my power lies.",
        "My time is finite; my will is not.",
        "What I build today, echoes tomorrow.",
        "I carve my purpose into every hour.",
        "The impediment to action advances action, what stands in the way becomes the way - the obstacle is the path.",
        "I do not control events, only my response.",
        "What is up to me is my judgment, my effort, and my character.",
        "Hardship is the training ground of my soul.",
        "Everything I lose was only ever on loan.",
        "Today I practice courage, justice, self-control, and wisdom.",
        "No insult can harm me without my consent.",
        "I accept fate, and still choose noble action.",
        "This moment is enough for virtue.",
        "Remember: you will die; therefore, truly live now.",
        "Hard choices, easy life. Easy choices, hard life.",
        "You are the sum of the things you pay attention to.",
        "Simplicity is the ultimate sophistication.",
        "Confidence is the reputation you have with yourself.",
        "Action is not the effect of motivation; it is the cause of it.",
        "Regret is a more durable fuel than motivation.",
        "The magic you are looking for is in the work you are avoiding.",
        "A clear plan relieves you of the torment of choice.",
        "Most of your problems are not problems; they are just a lack of action.",
        "If you want to be someone who does hard things, you have to do hard things.",
        "You don't need more time; you need more focus",
        "Busyness is an emotional gastric band.",
        "In life, we must choose our regrets.",
        "The pain of discipline is far less than the pain of regret.",
        "The best way to get something done is to begin.",
        "Discipline is choosing between what you want now and what you want most.",
        "Lower your threshold for joy to become invincible.",
        "Optimization is a defense mechanism against living.",
        "Success often feels like relief, not joy.",
        "Ambition and self-acceptance are naturally at war.",
        "Vulnerability is the price of connection.",
        "You are not 'too busy'; you are just prioritizing comfort.",
        "The Crisis of Purpose is a Crisis of Service.",
        "Stop trying to be 'right'; try to be 'effective'."
    ],
    "age": 34,
    "purposeLabel": "",
    "necessityBlocks": [
        { "name": "Work", "color": "#3b82f6" },
        { "name": "Chores", "color": "#6b7280" },
        { "name": "Exercise", "color": "#22c55e" },
        { "name": "Relaxation", "color": "#ec4899" }
    ],
    "objectives": {
        "long-term-purpose": [
            "Define your life's primary mission",
            "Break down your purpose into achievable milestones",
            "Identify what you need to learn or master"
        ],
        "weekly-purpose": [
            "Make meaningful progress on one aspect of your purpose",
            "Dedicate focused time blocks to purpose work"
        ],
        "weekly-necessity": [
            "Complete essential work tasks",
            "Maintain basic life responsibilities"
        ]
    }
}